package ch04;

public class OpEx8 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
/*
 * shift 연산자 : 비트이동 연산자
 * 	<< n : 왼쪽으로 n비트만큼 이동. 오른쪽의 n비트 0으로 채움.
 * 	>> n : 오른쪽으로 n비트만큼 이동. 왼쪽의 n비트 부호비트 채움.	
 *  >>> n : 오른쪽으로 n비트만큼 이동. 왼쪽의 n비트 0으로 채움.
 *  int  사이즈는 32bit 4바이트니까. 맨 앞에 있는걸 부호비트(사인비트) 0이면 + 1이면 -
 */
		System.out.println("8 << 2 " + (8 << 2)); //32
		/*
		 * 8	: 00001000 <- 32개중 일부만 표시
		 * <<2	: 00100000 : 32
		 */
		System.out.println("8 >> 2 : " + (9 >>> 2)); //2
		/*
		 * 8	: 00001000
		 * >> 2	: 00000010
		 */
		System.out.println("8 >>> 2 : " + (8 >>> 2)); //2
		/*
		 * 8	: 00001000
		 * >>>2 : 00000010 : 2
		 */
		System.out.println("-8 << 2 : " + (-8 << 2)); //-32
		/*
		 * -8	: 11111000
		 * << 2 : 11100000 : -32
		 */
		System.out.println("-8 >> 2 : " + (-8 >> 2));
		/*
		 * -8	: 11111000
		 * >> 2 : 11111110 : -2
		 */
		System.out.println("-8 >>> 2 : " + (-8 >>> 2)); //1073741822
		/*
		 * -8	: 11111000
		 * >>>2 : 00111110
		 */
			
		
		
	}

}
